# BuiltInFailures.ScaleFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScaleFailures Class
BuiltInFailures Class Members See Also
---
Failures about Scale.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ScaleFailures
```

Visual Basic
---
```text
Public NotInheritable Class ScaleFailures
```

Visual C++
---
```text
public ref class ScaleFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ScaleFailures
# See Also
BuiltInFailures..::..ScaleFailures Members
Autodesk.Revit.DB Namespace